# GetEnumerator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..GetEnumerator Method
ExportPatternTable Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo))
```

Visual C++
---
```text
public:
virtual IEnumerator<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace